let arr = [
  'طراحی بسته‌بندی یک محصول جدید',
  'طراحی آرم یک شرکت یا یک سازمان',
  'ساخت پرتره یا عکس',
  'ترانه‌سرایی یا تنظیم هر نوع موسیقی',
  'طراحی مبلمان، لباس، یا پوستر',
  'طراحی صحنه برای یک نمایشنامه',
  'تماشای فیلم‌های مستند یا برنامه‌های تلوزیون درباره حیوانات یا دیگر مخلوقات',
  'مشاهده یا ثبت روند رشد گیاهان',
  'گردآوری یا ساخت نمونه‌های زیستی',
  'ردیابی یا رصد کردن حیوانات وحشی',
  'پرورش انواع گوناگون حیوانات یا گیاهان',
  'مشاهده یا ثبت عادات حیوانات کوچک مثل مورچه',
  'مرتب نگه داشتن یا به‌ روز کردن یک دفترچه تلفن',
  'تهیه موجودی تدارکات یا محصولات',
  'چک کردن اوراق یا محصولات برای رفع خطاها یا نقایص',
  'حفظ سوابق مشروح هزینه‌ها',
  'مدیریت امور روزانه در اداره',
  'طبقه‌بندی آیتم‌ها یا مرتب کردن انواع مختلف آیتم‌ها',
  'اجرای رقص یا اپرای سنتی چینی برای دیگران',
  'تبدیل شدن به یک چهره عمومی (مردمی)',
  'رئیس تشریفات یا محری یک شو یا برنامه تلوزیونی بودن',
  'لباس پوشیدن بر خلاف عرف جامعه',
  'استفاده از عکس و تصویر خود برای تبلیغ یک محصول یا شرکت',
  'حضور در یک رویداد به عنوان اعطاکننده جایزه',
  'کشف علل یک پدیده یا یک حادثه (تصادف)',
  'تایید یک نظریه علمی با عمل',
  'تفکر در باب اصول نحوه تدوین یا تغییر چیزها',
  'آگاهی از نظریه‌های علمی متفاوت از طریق مطالعه کتاب یا سخنرانی',
  'مطالعه عمقی یک نظریه معین از طریق مجموعه‌ای از منابع یا داده‌ها',
  'به کارگیری علم برای حل مسائل عملی',
  'حفظ یک شبکه کامپیوتری',
  'شکل‌دهی فلز یا پلاستیک با ابزارها',
  'تعمیرات پوشاک یا تجهیزات الکترونیکی',
  'راه‌اندازی ماشین‌آلات و دستگاه‌ها',
  'مونتاژ ابزارها یا وسایل اندازه‌گیری دقیق',
  'تعمیر کامپیوتر یا دیگر تجهیزات به منظور ارتقاء سطح کارآمدی آنها',
  'صحبت با دیگران برای کمک به شاد شدن آنها',
  'کمک به درس‌های بچه‌های همسایه',
  'مراقبت از افراد ضعیف، بیمار، یا تنها',
  'کار برای یک خیریه',
  'همراهی کردن با سالخورده‌های همسایه',
  'تشیوق همکاران زمانی که احساس سرخوردگی می‌کنند یا با مشکلاتی مواجه می‌شوند',
  'برنامه‌ریزی برای تعیین مسیر رشد یک تیم یا شرکت',
  'پیاده‌سازی تحلیل سرمایه‌گذاری برای یک شرکت',
  'کمک به بازاریابی فعالیت‌های اجتماعی',
  'تخصیص منابع انسانی، مادی، یا مالی یک سازمان',
  'ملاقات با مجریان یا رهبران مهم',
  ' توجه به حراجی‌های شرکت‌های فهرست‌شده',
  'انجام ورزش‌های متهورانه مثل اسکیت با کفش بلبرینگ‌دار یا حرکات محیرالعقول با دوچرخه',
  'کشف مناطق غیرقابل‌سکونت',
  'بالا رفتن از یک قله خطرناک',
  'مشارکت در عملیات نجات مخاطره‌آمیز مثل اطفاء حریق',
  'تبدیل شدن به راننده مسابقه حرفه‌ای',
  'انجام تجسس‌های جنایی'
]

let obj = arr.map((val, i) => {
  let type
  if (i < 6) {
    type = 'A'
  } else if (i < 12) {
    type = 'B'
  } else if (i < 18) {
    type = 'C'
  } else if (i < 24) {
    type = 'D'
  } else if (i < 30) {
    type = 'E'
  } else if (i < 36) {
    type = 'F'
  } else if (i < 42) {
    type = 'G'
  } else if (i < 48) {
    type = 'H'
  } else {
    type = 'I'
  }
  return {
    id: i + 1,
    title: val,
    answer: null,
    type
  }
})
console.log(obj)
