let arr = [
  ' به کتاب و کتابخوانی علاقه ی فراوانی دارم.',
  'می توانم به سرعت و آسانی اعداد را در ذهنم حساب کنم.',
  'وقتی چشمانم را می بندم می توان تصاویر واضحی را ببینم.',
  'من به طور منظم حداقل در یک ورزش با فعالیت های بدنی شرکت دارم.',
  'افراد اغلب برای مشورت یا راهنمایی گرفتن نزد من می آیند.',
  'من معمولا زمانی را در تنهایی صرف تفکر، مراقبه و اندیشیدن در مورد سوالات مهم زندگی می کنم.',
  'من از صدای دلنشینی برای خواندن برخوردارم.',
  'من همه ی انواع حیوانات را دوست دارم.',
  'قبل از نوشتن یا گفتن یا خواندن کلمات، آن ها را در ذهنم می شنوم.',
  'در مدرسه از درس هایی چون ریاضیات و علوم لذت می برم.',
  'من نسبت به رنگ هاعلاقمند و حساسم.',
  'خیلی مشکل است که برای مدت طولانی آرام در جایی بنشینم.',
  'ورزش های گروهی را بیشتر از ورزش های انفرادی ترجیح می دهم.',
  'در جلساتی که با رشد و آگاهی¬های فردی افزوده می شود شرکت می¬کنم.',
  'آهنگ های ناموزون و سازمان های خارج از ریتم را تشخیص می دهم.',
  'دوست دارم چیزهایی را سازمان بندی یا مرتب کنم.',
  'گوش کردن به رادیو و نوار صوتی بیشتر از تلویزیون یا فیلم به من آموزش می دهد.',
  'از بازی های منطقی معما ها وسایر بازی های فکری (از قبیل شطرنج) لذت می برم.',
  'اغلب برای ضبط محیط اطرافم (در صورت امکان) از دوربین فیلمبرداری استفاده می کنم.',
  'به کارهایی که با دست انجام می شود مانند دوختن، بافتن، نجاری ، مدل سازی، حکاکی علاقمندم.',
  'وقتی مشکل دارم ترجیح می دهم از کسی کمک بگیرم تا اینکه تنهایی روی آن کار کنم.',
  'قادرم با شکست ها و مشکلاتم با حالتی انعطاف پذیرمواجه شوم.',
  'اغلب به موزیک هایی از رادیو یا ضبط صوت یا سی دی و غیره گوش می¬دهم.',
  'من از طبیعت لذت می برم.',
  'من از بازی با کلمات مانند جدول کلمات متقاطع، ، جملات درهم ریخته یا اسم رمز ها لذت می برم.',
  'دوست دارم آزمایش هایی (اگر...آنگاه) ترتیب دهم، (مثلا اگر به گیاهانم دوبرابر کود دهم چه اتفاقی می افتد)؟',
  'من از معما های دیداری مانند پازل ها و تصاویر سه بعدی لذت می برم.',
  'بهترین افکار وقتی به سراغ من می آیند که مشغول یک فعالیت جسمی (از قبیل پیاده روی، دو، شنا و...) هستم.',
  'من حداقل سه دوست نزدیک دارم.',
  'یک سرگرمی یا مشغولیت و فعالیت ویژه ای دارم که به تنهایی انجام می¬دهم.',
  'یکی از آلات موسیقی را می نوازم.',
  'من کلکسیونی از قبیل سنگ ها، صدف ها، برگ ها، حشرات، تمبر ، کارت های ورزشی... را جمع می کنم.',
  'من اغراق های زبانی ، ایهام، آهنگ های بی معنی و کلمات دو پهلو را دوست دارم.',
  'من در جستجوی الگوها، توالی یا نظم و سازمان چیزها هستم.',
  'در خواب رویاهای روشنی می بینم.',
  'اغلب دوست دارم اوقات فراغت خود را بیرون خانه سپری کنم.',
  'من از سرگرمی های جمعی مانند منچ بیشتر از سرگرمی های فردی مانند بازی های رایانه ای خوشم می آید.',
  'اهداف ویژه ای در زندگی دارم که مرتب به آن ها فکر کنم.',
  'زندگی من بدون موسیقی بسیار یکنواخت و بی هیجان خواهد بود.',
  'من مرتبا گزارش تغییرات هوایی را کنترل می کنم.',
  'دروس ادبیات و اجتماعی از ریاضی و علوم برایم آسان تر هستند.',
  'درباره چگونگی کارکرد چیزها علاقمندم و در مورد پیشرفت های علمی و کشفیات جدید علم خود را به روز نگه می دارم.',
  'معمولا قادرم مسیر در یک محل نا آشنا پیدا کنم.',
  'هنگام صحبت تمایل دارم دست های خود را تکان دهم و از ژست ها (مانند تغییر چهره) استفاده کنم.',
  'از آموزش دادن دانسته هایم به دیگران لذت می برم.',
  'من از طریق عکس العمل دیگران، دیگاه واقع بینانه ای نسبت به نقاط قوت و ضعف خود دارم.',
  'اغلب در طی روز مدام یک آهنگ در ذهنم اجرا می شود.',
  'تفاوت های موجود میان انواع درختان، سنگ ها، پرندگان یا سایر گیاهان و جانوران را به خوبی بیان می کنم.',
  'وقتی در ماشین هستم دوست دارم علایم و تابلوهای تبلیغاتی را بخوانم و به آنها بیشتر از مناظر اطراف توجه کنم.',
  'باور دارم تقریبا برای هر چیزی یک تفسیر منطقی وجود دارد.',
  'من اغلب طراحی می کنم.',
  'من نیاز دارم چیزها را لمس کرده یا نگه دارم تا بتوانم بیشتر درباره آنها یاد بگیرم.',
  'من رهبر نامیده می شوم و خودم را چنان تصور می کنم.',
  'من ترجیح می دهم تعطیلات آخر هفته را در یک اتاق یا مکان خلوت سپری کنم تا اینکه در یک جای عمومی و شلوغ باشم.',
  'با استفاده از یک ابزار موسیقی ساده و یا نواهای مذهبی به راحتی می توانم اوقات فراغت خود را سپری کنم.',
  'من از ماهیگیری ، باغبانی، کاشتن گیاهان و آشپزی لذت می برم.',
  'اغلب در مکالماتم به چیزهایی اشاره می کنم که قبلا خوانده یا شنیده ام.',
  'من می توانم به صورت واضح به مفاهیم غیر ملموس و خیالی فکر کنم.',
  'جغرافیا از ریاضی برایم آسان تر است.',
  'من از بازی های پرهیجان (از قبیل پینت بال و رانندگی پر هیجان) لذت می برم.',
  'من در میان جمع احساس راحتی می کنم.',
  'من با اراده و مستقل هستم.',
  'آهنگ های بسیاری از آوازها یا قطعات موسیقی را می دانم.',
  'از مشاهده رویدادهای طبیعی ( مانند ستاره ها، ماه، جزر و مد ) لذت برده و دوست دارم جزییات اطلاعات درباره آنها را بدست آورم.',
  'اغلب افراد معنی کلمات را از من می پرسند.',
  'به کشف عیوب منطقی کارهایی که به مردم در خانه و محل کار خود انجام می دهند یا در مورد آنها صحبت می کنند، علاقه دارم.',
  'می توانم تصور کنم، (ازنگاه یک پرنده) اجسام از بالا چگونه به نظر می¬رسند.',
  'من از نظر جسمی و اندازه اندام های بدنی کاملا متناسبم.',
  'من در فعالیت های مدرسه، مسجد، همسایگان و فعالیت های اجتماعی درگیر می شوم.',
  'من یک دفتر خاطرات روزانه دارم تا اتفاقات زندگی ام را یادداشت کنم.',
  'اگر یک قطعه موزیک را یک یا دوبار بشنوم می توانم به آسانی آن را تکرار کنم.',
  'دوست دارم کتاب ها یا محلاتی را بخوانم یا برنامه های تلویزیونی را ببینم که به طبیعت مربوط می شود.',
  'اخیرا چیزی نوشته ام که به آن افتخار می کنم.',
  'وقتی چیزی به روش خاصی اندازه گیری ، طبقه بندی، تجزیه یا کمیت گذاری می شود احساس خوبی دارم.',
  'من ترجیح می دهم کتاب، مجلات، روزنامه هایی را بخوانم که تصاویر زیادی دارد.',
  'برای یادگیری مهارت های جدید نیاز دارم تا تمرین انجام دهم، به جای اینکه درباره آن بخوانم یا فیلمی را تماشا کنم.',
  'من ترجیح می دهم شب تعطیل را در یک میهمانی تا تنها در خانه بمانم.',
  'من ترجیح می دهم یک شغل مستقل داشته باشم تا برای دیگران کار کنم.',
  'اغلب هنگام کار کردن آواز می خوانم یا زمزمه می کنم یا ضربه می زنم.',
  'در تعطیلات خود ترجیح می دهم به مکان های طبیعی مانند پارک یا جنگل بروم تا به یک هتل مجلل و پر از رفت وآمد.'
]

let obj = arr.map((val, i) => {
  let type
  if (i % 8 == 0) {
    type = 'linguistic'
  }
  if (i % 8 == 1) {
    type = 'mathematical'
  }
  if (i % 8 == 2) {
    type = 'visual'
  }
  if (i % 8 == 3) {
    type = 'kinesthetic'
  }
  if (i % 8 == 4) {
    type = 'interpersonal'
  }
  if (i % 8 == 5) {
    type = 'intrapersonal'
  }
  if (i % 8 == 6) {
    type = 'musical'
  }
  if (i % 8 == 7) {
    type = 'naturalistic'
  }
  return {
    id: i + 1,
    title: val,
    answer: null,
    type
  }
})
console.log(obj)
