let arr = [
  'اگر من از یک نمایشگاه هنری دیدن کنم، به صورت کلی حوصله ام سر می رود.',
  'از قبل برنامه ریزی می کنم و چیزها را سازماندهی می کنم تا در آخرین لحظه به دست و پا زدن نیفتم.',
  'خیلی به ندرت از کسی کینه به دل می گیرم، حتی در مورد کسانی که به من خیلی بد کرده اند.',
  'براساس منطق و دلیل به صورت کلی از خودم راضی هستم.',
  'اگر مجبور به سفر در شرایط بد آب و هوایی بشوم، دچار بیم و هراس می شوم.',
  'برای ترفیع گرفتن یا جلو افتادن در کارم چاپلوسی نمی کنم، حتی اگر فکر کنم که تملق و چاپلوسی در آن شرایط موثر است.',
  'علاقه مند به آموختن در مورد تاریخ و مسایل سیاسی کشورهای دیگر هستم.',
  'وقتی روی دست یابی به هدفی کار می کنم، اغلب خیلی سخت تلاش می کنم.',
  'گاهی وقت ها مردم به من می گویند که خیلی از دیگران ایراد می گیرم.',
  'در جلسات گروهی به ندرت نظر خودم را بیان می کنم.',
  'گاهی وقت ها نمی توانم جلوی نگرانیم برای مسایل کوچک را بگیرم.',
  'اگر بدانم که احتمالا هیچ وقت گیر نمی افتم، ممکن است بخواهم یک میلیون دلار یا یورو بدزدم.',
  'اگر بتوانم یک اثر هنری مثل یک رمان داستانی یا یک آهنگ یا یک نقاشی خلق کنم، از آن کار لذت خواهم برد.',
  'وقتی روی چیزی کار می کنم، خیلی به جزییات و مسایل ریز دقت نمی کنم.',
  'گاهی وقت ها مردم به من می گویند که خیلی یکدنده هستم.',
  'من کارهایی را که همراه با تعاملات اجتماعی باشد را به کارهایی که تنهایی باید انجام داد، ترجیح می دهم.',
  'هرگاه از تجربه دردناکی رنج ببرم به کسی احتیاج دارم که به من احساس آرامش بدهد.',
  'داشتن یک عالمه پول برای من اهمیت خاصی ندارد.',
  'به نظرم توجه به افکار افراطی وقت تلف کردن است.',
  'صمیم های من بیشتر نتیجه احساسی است که در آن لحظه دارم، شکل می گیرند و نه براساس فکر کردن دقیق.',
  'دیگران فکر می کنند، من آدمی هستم که زود جوش می آورد.',
  'اغلب روزها احساس سرزندگی و خوش بینی می کنم.',
  'وقتی دیگرانی را در حال گریه می بینم، من هم گریه ام می گیرد.',
  'فکر می کنم نسبت به متوسط مردم، از احترام بیشتری برخوردارم.',
  'اگر فرصت داشته باشیم، در یک کنسرت موسیقی سنتی و کلاسیک شرکت خواهم کرد.',
  'موقع کار، گاهی در کنار آمدن با بی برنامگی و بی نظمی مشکل دارم.',
  'رویکرد من نسبت به افرادی که به من بدی کرده اند این است که «ببخش و فراموش کن».',
  'احساس می کنم آدم محبوبی نیستم.',
  'وقتی پای خطرهای جسمانی به میان می آید، خیلی دچار هراس می شوم.',
  'اگر کارم گیر کسی باشد حتی به بی‌مزه‌ترین جوک هایش هم می خندم.',
  'هیچ وقت از گشتن به دنبال مطلبی در فرهنگ ها و دانشنامه ها لذت نبرده ام.',
  'من فقط حداقل حجم کاری را که برای گذران امور لازم است، انجام می دهم.',
  'در قضاوت هایم در مورد مردم، مایل به آسان گیری و مدارا هستم.',
  'در موقعیت های اجتماعی، معمولا اولین کسی هستم که پا پیش می گذارد و اولین حرکت را انجام می دهد.',
  'من نسبت به اغلب مردم کمتر نگران هستم.',
  'هیچ وقت رشوه قبول نمی کنم حتی اگر خیلی زیاد باشد.',
  'مردم اغلبه به من می گویند که من تصویر سازی و تخیل قوی ای دارم.',
  'من سعی می کنم همیشه در کارم دقیق باشم، حتی وقتی که تحت فشار زمانی هستم.',
  'من بیشتر اوقات وقتی دیگران با نظر من مخالفت می کنند در مورد نظرم انعطاف پذیر هستم.',
  'اولین کاری که در موقعیت های جدید انجام می دهم دوست شدن با افراد است.',
  'بدون نیاز به حمایت عاطفی دیگران، می توانم از عهده موقعیت های سخت بر بیایم.',
  'اگر ممکن باشد، از داشتن اجناس لوکس گران قیمت خیلی لذت می برم.',
  'از افرادی که دیدگاه های غیر معمول دارند خوشم می آید.',
  'من خیلی اشتباه می کنم چون قبل از عمل، فکر نمی کنم.',
  'اغلب مردم سریعتر از من عصبانی می شوند.',
  'اغلب مردم سرحال تر و پویا تر از حالت معمول من هستند.',
  'وقتی افراد نزدیک به من برای مدت طولانی از من دور می شوند، سخت احساساتی می شوم.',
  'می خواهم دیگران بدانند که من فردی مهم و و صاحب جایگاه و شان هستم.',
  'خودم را جزیی از گروه افراد هنرمند و خلاق نمی دانم.',
  'دیگران اغلب به من «کمالگرا» می گویند.',
  'حتی وقتی دیگران خیلی اشتباه می کنند، به ندرت چیزی منفی به زبان می آورم.',
  'گاهی وقت ها احساس بی ارزشی می کنم.',
  'حتی در شرایط اضطراری، احساس وحشت زدگی نمی کنم.',
  'فقط برای این که کسی کاری برایم انجام بدهد، وانمود نمی کنم که از او خوشم می آید.',
  'بحث فلسفی به نظرم حوصله سربر است.',
  'ترجیح می دهم کاری را که به ذهنم می رسد انجام بدهم تا این که به اجرای یک برنامه از قبل ریخته شده بچسبم.',
  'وقتی دیگران به من می گویند که اشتباه می کنم، اولین واکنش من جدل کردن با آن ها است.',
  'وقتی در گروهی هستم، اغلب این من هستم که از طرف گروه صحبت می کنم.',
  'حتی در موقعیت هایی که بیشتر مردم احساساتی می شوند، من غیر احساساتی می مانم.',
  'اگر بدانم که گیر نمی افتم ممکن است که برای جعل پول وسوسه بشوم.'
]
let obj = arr.map((val, i) => {
  let type
  if (i % 6 == 0) {
    type = 'honestyHumility'
  }
  if (i % 6 == 1) {
    type = 'emotionality'
  }
  if (i % 6 == 2) {
    type = 'extraversion'
  }
  if (i % 6 == 3) {
    type = 'agreeableness'
  }
  if (i % 6 == 4) {
    type = 'conscientiousness'
  }
  if (i % 6 == 5) {
    type = 'opennessToRxperience'
  }
  return {
    id: i + 1,
    title: val,
    answer: null,
    type
  }
})
console.log(obj)
