<style lang="scss" scoped>
.item {
  margin-bottom: 20px;
  .item-title {
    color: $primary-color;
    font-size: 26px !important;
    font-weight: 600;
  }
  .item-subtitle {
    padding-right: 8px;
    color: #555;
    font-size: 18px;
    opacity: 0.9;
  }
  ul {
    padding-right: 16px;
    li {
      font-weight: 500;
      color: #333;
      display: flex;
      align-items: center;
      height: 30px;
      font-size: 15px;
      &:before {
        content: '';
        width: 5px;
        height: 5px;
        background: $primary-color;
        border-radius: 100%;
        display: inline-flex;
        margin-left: 8px;
      }
    }
  }
}
</style>
<template>
  <div>
    <div
      class="display-2 text-center my-12 fontwe font-weight-medium blue-grey--text text--darken-1"
    >نتیجه تست رغبت شغلی شما</div>
    <div v-for="(item, index) in result" :key="index" class="item">
      <div class="item-title">
        <span>{{index+1 | persianDigit}} -</span>
        <span>{{item.title}}</span>
      </div>
      <div class="item-subtitle">
        <span>{{item.description}}</span>
      </div>
      <div>
        <ul>
          <li v-for="(item, index) in item.jobs" :key="index">{{item}}</li>
        </ul>
      </div>
    </div>
  </div>
</template>
<script lang="ts">
import Vue from 'vue'
const map_value = {
  A: {
    title: 'هنر، ارتباطات و فن‌آوری سمعی/بصری',
    description:
      'علاقه به هنرهای خلاقانه یا نمایشی، ارتباطات یا فن‌آوری‌های سمعی و بصری.',
    jobs: [
      'بازیگر',
      'کارگردان هنری',
      'کارشناس فنی پخش',
      'فیلمبردار (اپراتور دوربین)',
      'آهنگساز و تنظیم‌کننده موسیقی',
      'تدوین‌گر فیلم و آثار ویدئویی',
      'نقشه‌کش، طراح',
      'گزارشگر خبری',
      'عکاس',
      'تهیه‌کننده و کارگردان',
      'طراحی صحنه و نمایش',
      'نویسنده فنی',
      'طراحی گرافیکی'
    ]
  },
  B: {
    title: 'علم، فن‌آوری، مهندسی و ریاضیات',
    description:
      'علاقه به حل مساله، اکتشاف، گردآوری و تحلیل اطلاعات و به‌کارگیری یافته‌ها در مسائل حوزۀ علوم، ریاضی و مهندسی.',
    jobs: [
      'مهندس هوا-فضا',
      'بیولوژیست (زیست‌شناس)',
      'شیمی‌دان',
      'مهندس برق و الکترونیک',
      'جغرافی‌دان',
      'مهندس نفت [خام]',
      'مهندس مکانیک',
      'هواشناس',
      'فیزیکدان',
      'مهندس ایمنی/امنیت '
    ]
  },
  C: {
    title: 'گیاهان، کشاورزی، منابع طبیعی',
    description:
      'علاقه به فعالیت‌های مرتبط با گیاهان، به طور معمول در محیط‌های برون‌ساختمانی.',
    jobs: [
      'مهندس کشاورزی',
      'دانشمند کشاورزی',
      'تربیت‌کننده حیوانات',
      'سرآشپز',
      'دانشمند بقاء انرژی',
      'مکانیک تجهیزات و ماشین‌آلات مزرعه',
      'مامور حفاظت از حیوانات و منابع طبیعی',
      'جنگلدار',
      'دامپزشک',
      'جانورشناس '
    ]
  },
  D: {
    title: 'حقوق (قانون)، امنیت عمومی، اصلاحات و امنیت',
    description: 'علاقه به خدمات قضایی، حقوقی، و حفاظتی برای مردم و مایملک.',
    jobs: [
      'مامور پزشکی قانونی',
      'مامور اصلاحات ',
      'کارمند دادگاه',
      'کارآگاه و بازپرس (مامور تحقیق)',
      'مامور آتش‌نشانی',
      'قاضی',
      'وکیل',
      'نجات‌غریق و ناجی اسکی‌‌بازان',
      'افسر گشت پلیس'
    ]
  },
  E: {
    title: 'ساخت و تولید مکانیکی',
    description:
      'علاقه به پیاده‌سازی اصول مکانیکی در موقعیت‌های کاربردی با استفاده از ماشین‌آلات، ابزاآلات دستی یا تکنیک‌های مختلف',
    jobs: [
      'مهندس شیمی',
      'اپراتور جرثقیل چنگک‌دار',
      'اپراتور تاسیسات نفت و گاز',
      'جواهرساز',
      'قفل ساز/کلیدساز',
      'کارگر پرداخت‌کار فلزات/پلاستیک',
      'تعمیرکار ماشین‌آلات اداری',
      'اپراتور نیروگاه‌',
      'کارگر کارگاه کفش و چرم‌سازی',
      'جوشکار'
    ]
  },
  F: {
    title: 'ساخت و تولید صنعتی',
    description:
      'علاقه به فعالیت‌های تکرارشوندۀ سازماندهی‌شده در یک کارخانه یا موقعیت صنعتی.',
    jobs: [
      'مهندس شیمی',
      'اپراتور جرثقیل چنگک‌دار',
      'اپراتور تاسیسات نفت و گاز',
      'جواهرساز',
      'قفل ساز/کلیدساز',
      'کارگر پرداخت‌کار فلزات/پلاستیک',
      'تعمیرکار ماشین‌آلات اداری',
      'اپراتور نیروگاه‌',
      'کارگر کارگاه کفش و چرم‌سازی',
      'جوشکار'
    ]
  },
  G: {
    title: 'کسب و کار، مدیریت و امور اجرایی',
    description: 'علاقه به سازماندهی، هدایت و ارزیابی کارکردهای کسب و کار',
    jobs: [
      'حسابدار',
      'مدیر تبلیغات',
      'اپراتور کامپیوتر',
      'تحلیلگر مدیریت',
      'برنامه‌ریز جلسات و قراردادها',
      'کارمند بخش پرداخت حقوق کارکنان',
      'مدیر فروش مایملک و املاک',
      'کارمند ارسال و تحویل کالا ',
      'آمارشناس'
    ]
  },
  H: {
    title: 'بازاریابی، فروش و خدمات',
    description:
      'علاقه به جلب توجه و دیدگاه دیگران به یک نقطه خاص از طریق فنون متقاعد‌سازی شخصی، با استفاده از شیوه‌های فروش یا تبلیغات',
    jobs: [
      'فروشنده تبلیغ‌کننده کالا',
      'کارگزار مشتری و خرید اجناس',
      'نماینده خدمات مشتریان',
      'طراح گل و گیاه',
      'تحلیلگر تحقیقات بازاری',
      'کارگزار فروش املاک'
    ]
  },
  I: {
    title: 'میزبانی و گردشگری (توریسم)',
    description:
      'علاقه به ارائه خدمات به دیگران به واسطه خدمات‌رسانی وابسته به برنامه‌ریزی سفر و میزبانی در هتل‌ها، رستوران‌ها و اماکن تفریحی و سرگرمی',
    jobs: [
      'باربر چمدان و پادو مهمانخانه',
      'سرآشپز و آشپز پخت ناهار',
      'کارگر سرو غذا',
      'مدیر هتل',
      'سرپرست سرایدار/نگهبان ساختمان',
      'مسئول تهیه بلیط و رزرو جا',
      'مدیر رستوران',
      'راهنمای تور (گردشگری)',
      'کارگزار مسافرتی',
      'حَکَم و داور'
    ]
  },
  J: {
    title: 'خدمات انسانی',
    description:
      'علاقه به کمک به افراد نیازمند به مشاوره یا خدمات روانی، معنوی، جسمی، یا شغلی.',
    jobs: [
      'مسئول مراقبت از کودک',
      'روحانی',
      'متخصص آرایش و زیبایی',
      'مشاور',
      'مسئول برگزاری مراسم تدفین',
      'مانیکورکار',
      'گریمور/میکاپ-آرتیست حرفه‌ای ',
      'مشاور مالی',
      'روان‌شناس',
      'مشاور اسکان و اقامت',
      'فعال اجتماعی'
    ]
  },
  K: {
    title: 'دولت و مدیریت اجرایی عمومی',
    description:
      'علاقه به کارکردهای دولتی/حکومتی در سطوح محلی، ایالتی و فدرالی.',
    jobs: [
      'دستیار برنامه‌ریز شهری',
      'بازرس ساخت و ساز (راه و ساختمان) ',
      'مفسر و مترجم',
      'کارمند صدور مجوز',
      'متخصص بهداشت شغلی',
      'بازپرس مالیاتی'
    ]
  },
  L: {
    title: 'معماری، طراحی و ساخت',
    description:
      'علاقه به طراحی، برنامه‌ریزی، مدیریت، ساخت و حفظ بناها و سازه‌های فیزیکی.',
    jobs: [
      'معمار',
      'کابینت‌ساز',
      'نجار',
      'مدیر ساخت و ساز ',
      'برق‌کار',
      'مهندس عمران',
      'کارگر ساختمانی عادی',
      'کارگر حفاظت از بزرگراه‌ها',
      'طراح داخلی',
      'حلبی‌ساز',
      'کارشناس فنی مساحی و نقشه‌برداری'
    ]
  },
  M: {
    title: 'آموزش و تربیت',
    description:
      'علاقه به برنامه‌ریزی، مدیریت و تامین خدمات آموزشی، از جمله خدمات پشتیبانی، خدمات کتابخانه و اطلاع‌رسانی.',
    jobs: [
      'متخصص صوتی/تصویری',
      'مربی و آموزش‌گر ورزشی',
      'مدیر یا رئیس کالج/دانشگاه',
      'آموزگار/استاد دانشگاه',
      'مسئول کتابخانه',
      'آموزش‌گر بهداشت و سلامت عمومی',
      'مدرس آموزش ویژه',
      'آسیب‌شناس گفتاری (گفتار-درمان)'
    ]
  },
  N: {
    title: 'امور مالی، بانکداری، سرمایه‌گذاری و بیمه',
    description:
      'علاقه به برنامه‌ریزی مالی و سرمایه‌گذاری و مدیریت، و تامین خدمات بانکداری و بیمه.',
    jobs: [
      'کارمند حسابداری',
      'ارزیاب (تعیین‌کننده قیمت موارد موردنظر)',
      'تحلیلگر اعتبار',
      'کنترل‌کننده اعتبار',
      'اقتصاددان',
      'مشاور مالی',
      'کارشناس و محقق خسارات بیمه',
      'کارگزار بیمه',
      'مامور اعتبارات (وام و قرضه)',
      'تهیه‌کننده (برآوردکننده) مالیات'
    ]
  },
  O: {
    title: 'علوم بهداشت و سلامت، مراقبت و پیشگیری',
    description:
      'علاقه به کمک به دیگران از طریق ارائه خدمات تشخیصی، درمانی، اطلاع‌رسانی و محیط‌زیستی، از جمله تحقیق و توسعه خدمات مراقبتی-بهداری جدید.',
    jobs: [
      'متخصص بیهوشی',
      'مربی ورزش حرفه‌ای',
      'متخصص ماساژدرمانی',
      'دندانپزشک',
      'کارشناس فنی پزشکی اورژانس',
      'فیزیوتراپ',
      'روان‌درمانگر شغلی',
      'داروساز/داروفروش',
      'پزشک',
      'پرستار مجاز (ثبت‌شده'
    ]
  },
  P: {
    title: 'فن‌آوری اطلاعات (IT)',
    description:
      'علاقه به طراحی، توسعه، پشتیبانی و مدیریت سیستم‌های سخت‌افزاری، نرم‌افزاری، چندرسانه‌ای، خدمت یکپارچه‌سازی سیستم‌ها و پشتیبانی فنی.',
    jobs: [
      'مدیر سیستم‌های کامپیوتری/اطلاعاتی',
      'مهندس کامپیوتر',
      'برنامه‌نویس کامپیوتر',
      'متخصص امنیت کامپیوتری',
      'متخصص پشتیبانی کامپیوتری',
      'تحلیلگر سیستم‌های کامپیوتری',
      'تحلیلگر ارتباطات/مخابره داده‌ها/اطلاعات',
      'مکانیک IT'
    ]
  },
  Q: {
    title: 'حیوانات، کشاورزی و منابع طبیعی',
    description:
      'علاقه به فعالیت‌های مرتبط با تربیت، پرورش، تغذیه و مراقبت از حیوانات.',
    jobs: [
      'مهندس کشاورزی',
      'دانشمند کشاورزی',
      'تربیت‌کننده حیوانات',
      'سرآشپز',
      'دانشمند بقاء انرژی',
      'مکانیک تجهیزات و ماشین‌آلات مزرعه',
      'مامور حفاظت از حیوانات و منابع طبیعی',
      'جنگلدار',
      'دامپزشک',
      'جانورشناس '
    ]
  },
  R: {
    title: 'حمل و نقل، توزیع و لجستیک',
    description:
      'علاقه به حمل و نقل و جابه‌جایی مردم، مواد و کالاها از طریق جاده، خطوط لوله‌کشی، خطوط هوایی، خطوط راه‌آهن یا راه‌های آبی.',
    jobs: [
      'کنترل‌کننده ترافیک هوایی',
      'خلبان هواپیما',
      'مکانیک اتومبیل',
      'مهماندار هواپیما',
      'مکانیک قایق‌موتوری',
      'راننده اتوبوس مدرسه',
      'اپراتور ترن‌های مترو یا اتوبوس‌ خیابانی',
      'کارشناس فنی ترافیک',
      'کارگزار حمل و نقل'
    ]
  }
}
export default Vue.extend({
  props: {
    data: {
      required: true,
      type: Array as () => any
    }
  },
  computed: {
    result() {
      return this.data.splice(0, 3).map(item => {
        item = Object.assign(item, map_value[item.job])
        return item
      })
    }
  }
})
</script>